["There are no crying scenes of Chuck Norris in any of his movies? That's strictly because Chuck Norris never allows stunt doubles for any of his scenes.","When Chuck Norris goes swimming, Jaws hears the scary music","By the time you see Chuck Norris in your rearview mirror, he's already kicked you in the face and is 10 car lengths ahead of you.","Chuck Norris won an Olympic Gold Medal in the Men's Singles Luge competition while riding down the ice on a pair of hair tweezers.","Chuck Norris had to take over on the 7th day of creating whilst God was resting.","When a biker falls while riding he gets a permanent case of road rash. When a ninja falls fighting Chuck Norris he gets a permanent case of Chuck rash.","Only one person cried when Chuck Norris was born and that was the doctor.... no one slaps Chuck Norris","Chuck Norris is so tough he makes onions cry.","Pac-Man was based on Chuck Norris. They both eat souls.","A panel of 5 judges survived after allowing a young Chuck Norris to win his 5th grade spelling bee by correctly spelling the word \"Encyclopedia\" as b,o,o,k.","Chuck Norris' denim shirt contains three Robin Williams's worth of chest hair.","Uncle Sam is Chuck Norris' nephew.","When Chuck Norris round house kicked hulk hogan he turned into Britney spears and got sent to the seventh dimension that is power ful","Chuck Norris can tell a 'yo mama' joke that is so perfect, your head will explode.","Chuck Norris' penis has a penis. And it's still bigger than yours!","Chuck Norris wil always kick your arse. Even in soviet russia.","No one can be sure what Chuck Norris looking at, only that it has 5 seconds left to live","Chuck Norris can light a fire.... underwater.","Chuck Norris doesn't have sperm, he has tiny white ninjas that have only one mission...seek and destroy.","It takes Chuck Norris 10 minutes to watch 60 minutes.","Chuck Norris once went fishing and roundhoused the Kraken in the face when he came back he feed his family for ten years.","Once a vampire sprang at Chuck Norris in the dark. Chuck Norris ate the poor create raw and alive.","Chuck Norris can make a movie with 75 cents and a dirty look.","Chuck Norris bought a whole chicken and ate only its soul","Chuck Norris' DNA is a quadruple-helix. You just have to take his word for it, as anyone trying to see it under a microscope gets their eye poked out.","Files don't become declassified, Chuck Norris just decides when the people need to know.","The most powerful malware that no anti-virus can quarantine is called Chuck Norris' roundhouse...","Some men have been able to pull large objects like cars or trucks with their teeth. Chuck Norris is able to pull the entire U.S. Navy Seventh Fleet.","Chuck Norris programs occupy 150% of CPU, even when they are not executing.","In 2014 Chuck Norris invested 1 cent with a Wall Street investment firm. As of today he became a billionaire."]